In [3]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': [10, 20, 30, 40, 50]})
threshold = 30
df

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

In [3]:
filtered_df = df[df.gt(threshold).any(axis=1)]
filtered_df

   A   B
3  4  40
4  5  50

In [4]:
df = pd.DataFrame({'A': [2, 1, 2], 'B': [2, 3, 1], 'C': [1, 2, 3]})
df

   A  B  C
0  2  2  1
1  1  3  2
2  2  1  3

In [5]:
sorted_df = df.sort_values(by=['A', 'B'])
sorted_df

   A  B  C
1  1  3  2
2  2  1  3
0  2  2  1

In [4]:
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'A': [7, 8, 9], 'B': [10, 11, 12]})
df1

   A  B
0  1  4
1  2  5
2  3  6

In [5]:
df2

   A   B
0  7  10
1  8  11
2  9  12

In [6]:
df3 = pd.concat([df1, df2], ignore_index=True)
df3

   A   B
0  1   4
1  2   5
2  3   6
3  7  10
4  8  11
5  9  12

In [14]:
df = pd.DataFrame({'A': [1, 2, 3, 4, 5]})
df

   A
0  1
1  2
2  3
3  4
4  5

In [16]:
cum_sum = df.cumsum()
cum_sum

    A
0   1
1   3
2   6
3  10
4  15

In [18]:
series = pd.Series(['apple', 'banana', 'cherry'])
series

0     apple
1    banana
2    cherry
dtype: object

In [22]:
def uppercase(x):
    return x.upper()

series_upper = series.map(uppercase)
series_upper

0     APPLE
1    BANANA
2    CHERRY
dtype: object